# Zadatak 74-а

# Унос дужине низа од корисника
n = int(input("Дужина низа n = "))
print("Унесите елементе низа: ")

# Креирање празне листе за смештање елемената низа
niz = list()

# Петља која се извршава n пута за унос свих елемената низа
for i in range(0, n):
    temp = int(input())  # Привремена променљива за чување унетог броја
    niz.append(temp)  # Додавање унетог броја у низ

# Верзија 1 - Приказ целог низа као листе
print(f"\nЕлементи низа: {niz}")

# Верзија 2 - Приказ елемената низа коришћењем for петље која итерира кроз елементе
print("\nЕлементи низа: ")
for i in niz:
    print(i)  # Приказ сваког елемента у новом реду

# Верзија 3 - Приказ елемената низа коришћењем for петље која итерира кроз индексе
print("\nЕлементи низа: ")
for i in range(0, n, 1):
    print(niz[i])  # Приступ елементима низа преко индекса
