# Zadatak 46
# Програм који проверава да ли је унети број Нивенов број.
# Нивенов број је број који је дељив сумом својих цифара.

# Унос броја од корисника
# input() функција прихвата унос са тастатуре као стринг
# int() функција конвертује стринг у цео број
unetiBroj = int(input("n = "))

# Иницијализација променљиве за суму цифара
sumaCifara = 0
# Копирамо вредност unetiBroj у променљиву trenutniBroj да бисмо сачували оригиналну вредност
trenutniBroj = unetiBroj

# Петља која се извршава док trenutniBroj има вредност већу од 0
# У свакој итерацији издвајамо по једну цифру броја
while trenutniBroj > 0:
    # trenutniBroj % 10 даје последњу цифру броја trenutniBroj (остатак дељења са 10)
    # Додајемо ту цифру у суму
    sumaCifara = sumaCifara + trenutniBroj % 10
    # trenutniBroj // 10 даје целобројни количник при дељењу са 10
    # Овиме ефективно уклањамо последњу цифру броја
    trenutniBroj = trenutniBroj // 10

# Проверавамо да ли је број unetiBroj дељив сумом својих цифара
# unetiBroj % sumaCifara == 0 значи да је остатак при дељењу unetiBroj са sumaCifara једнак 0
if unetiBroj % sumaCifara == 0:
    # Ако је услов испуњен, број је Нивенов
    print("Број", unetiBroj, "јесте Нивенов.")
else:
    # Ако услов није испуњен, број није Нивенов
    print("Број", unetiBroj, "није Нивенов.")

# ===========

# Zadatak 46
# Програм који проверава да ли је унети број Нивенов број.
# Нивенов број је број који је дељив сумом својих цифара.

# Унос броја од корисника
# input() функција прихвата унос са тастатуре као стринг
# int() функција конвертује стринг у цео број
n = int(input("n = "))

# Иницијализација променљиве за суму цифара
suma = 0
# Копирамо вредност unetiBroj у променљиву trenutniBroj да бисмо сачували оригиналну вредност
k = n

# Петља која се извршава док trenutniBroj има вредност већу од 0
# У свакој итерацији издвајамо по једну цифру броја
while k > 0:
    # trenutniBroj % 10 даје последњу цифру броја trenutniBroj (остатак дељења са 10)
    # Додајемо ту цифру у суму
    suma = suma + k % 10
    # trenutniBroj // 10 даје целобројни количник при дељењу са 10
    # Овиме ефективно уклањамо последњу цифру броја
    k = k // 10

# Проверавамо да ли је број unetiBroj дељив сумом својих цифара
# unetiBroj % sumaCifara == 0 значи да је остатак при дељењу unetiBroj са sumaCifara једнак 0
if n % suma == 0:
    # Ако је услов испуњен, број је Нивенов
    print("Број", n, "јесте Нивенов.")
else:
    # Ако услов није испуњен, број није Нивенов
    print("Број", n, "није Нивенов.")
