# Zadatak 50
# Саставити програм који сабира целе бројеве од 1 до 1000.
# Сабирање прекинути када сума постане једнака или већа од задате вредности х.
# Исиписати вредност суме и број сабирака

# Учитавамо вредност променљиве x са стандардног улаза
# int() функција конвертује унос из текстуалног облика у целобројни тип података
# input() функција приказује поруку "x = " и чека на унос корисника
broj = int(input("x = "))

# Иницијализујемо променљиву s (suma) на 0
# Ово је променљива у којој ћемо чувати текућу суму бројева
suma = 0

# Покрећемо петљу која иде кроз бројеве од 1 до 999
# range(1, 1000, 1) функција генерише низ бројева:
#   - почетак: 1 (први параметар)
#   - крај: 1000 (други параметар, али не укључује ову вредност)
#   - корак: 1 (трећи параметар, означава инкремент)
# променљива i добија вредности из овог низа у свакој итерацији
for i in range(1, 1000, 1):
    # Додајемо тренутну вредност променљиве i на суму s
    suma = suma + i

    # Проверавамо да ли је сума постала већа или једнака задатом x
    # Ако јесте, излазимо из петље помоћу break наредбе
    if (
        suma >= broj
    ):  # Измењено из s > x да би одговарало захтеву задатка (једнака или већа)
        break

# Исписујемо коначну вредност суме
# f-string форматирање омогућава уметање вредности променљиве s у текст
print(f"Сума = {suma}")

# Исписујемо број сабирака
# Вредност променљиве i представља последњи број који је додат у суму
print(f"Број сабирака: {i}")
