# Zadatak 46
# Програм за проверу да ли је број Нивенов.
# Нивенов број је број који је дељив сумом својих цифара.

n = int(input(" n = "))  # Учитавамо број који проверавамо

suma = 0  # Променљива за чување суме цифара
k = n  # Копирамо број у променљиву k за обраду

# Петља која издваја цифре броја и рачуна њихову суму
while k > 0:
    suma = suma + k % 10  # Додајемо последњу цифру броја на суму
    k = k // 10  # Уклањамо последњу цифру из броја

# Проверавамо да ли је број дељив сумом својих цифара
if n % suma == 0:
    print(f"Broj {n} jeste Nivenov!")  # Исписујемо да је број Нивенов
else:
    print(f"Broj {n} nije Nivenov!")  # Исписујемо да број није Нивенов
