# Zadatak 40-b
# Програм за рачунање суме Фибоначијевих бројева до н-тог члана

n = int(input(" n = "))  # Учитавање броја н од корисника

# Иницијализација променљивих
i = 3  # Бројач (почињемо од 3 јер су прва два члана већ урачуната у суму)
fpp = 1  # Први члан Фибоначијевог низа
fp = 1  # Други члан Фибоначијевог низа
s = 2  # Сума прва два члана Фибоначијевог низа (1+1)

# Израчунавање суме Фибоначијевих бројева до н
while i <= n:
    fn = fpp + fp  # Израчунавање следећег Фибоначијевог броја
    s = s + fn  # Додавање броја суми
    fpp = fp  # Припрема за следећу итерацију
    fp = fn  # Припрема за следећу итерацију
    i = i + 1  # Повећавање бројача
print(f"Suma  = {s}")  # Исписивање коначне суме
