# Zadatak 21

# Саставити програм који исписује обавештење да ли унете променљиве а, b и c
# које означавају дужине страница формирају троугао

import math

print(" Унесите странице троугла: ")

a = float(input(" a = "))
b = float(input(" b = "))
c = float(input(" c = "))

# Проверава се услов да ли три дужине могу формирати троугао
# По теореми неједнакости троугла, збир било које две странице мора бити већи од треће странице
if a + b > c and a + c > b and b + c > a:
    S = (a + b + c) / 2
    P = math.sqrt(
        S * (S - a) * (S - b) * (S - c)
    )  # Херонова формула за површину троугла
    P = round(P, 3)
    print(f" Странице формирају троугао поврсине P = {P}")
else:
    print(" Странице не формирају троугао.")
